chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/framework/peripheral/osc/processor/osc_p32mx150f256l.h
PLIB_INLINE_API bool PLIB_OSC_ExistsSysPLLOutputDivisor(OSC_MODULE_ID index)
{
    switch (index) {
        case OSC_ID_0 :
            return OSC_ExistsSysPLLOutputDivisor_PIC32_1(index);
        case OSC_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_OSC_SysPLLOutputDivisorSet(OSC_MODULE_ID index, OSC_SYSPLL_OUT_DIV PLLOutDiv)
{
    switch (index) {
        case OSC_ID_0 :
            OSC_SysPLLOutputDivisorSet_PIC32_1(index, PLLOutDiv);
            break;
        case OSC_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API uint16_t PLIB_OSC_SysPLLOutputDivisorGet(OSC_MODULE_ID index)
{
    switch (index) {
        case OSC_ID_0 :
            return OSC_SysPLLOutputDivisorGet_PIC32_1(index);
        case OSC_NUMBER_OF_MODULES :
        default :
            return (uint16_t)0;
    }
}

PLIB_INLINE_API bool PLIB_OSC_ExistsClockFail(OSC_MODULE_ID index)
{
    switch (index) {
        case OSC_ID_0 :
            return OSC_ExistsClockFail_Default(index);
        case OSC_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_OSC_ClockHasFailed(OSC_MODULE_ID index)
{
    switch (index) {
        case OSC_ID_0 :
            return OSC_ClockHasFailed_Default(index);
        case OSC_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_OSC_ExistsFRCTuning(OSC_MODULE_ID index)
{
    switch (index) {
        case OSC_ID_0 :
            return OSC_ExistsFRCTuning_Default(index);
        case OSC_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_OSC_FRCTuningSelect(OSC_MODULE_ID index, OSC_FRC_TUNE_TYPE tuningValue)
{
    switch (index) {
        case OSC_ID_0 :
            OSC_FRCTuningSelect_Default(index, tuningValue);
            break;
        case OSC_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_OSC_ExistsReferenceOscBaseClock(OSC_MODULE_ID index)
{
    switch (index) {
        case OSC_ID_0 :
            return OSC_ExistsReferenceOscBaseClock_PIC32_1(index);
        case OSC_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_OSC_ReferenceOscBaseClockSelect(OSC_MODULE_ID index, OSC_REFERENCE referenceOsc, OSC_REF_BASECLOCK refOscBaseClock)
{
    switch (index) {
        case OSC_ID_0 :
            OSC_ReferenceOscBaseClockSelect_PIC32_1(index, referenceOsc, refOscBaseClock);
            break;
        case OSC_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_OSC_ExistsReferenceOscChange(OSC_MODULE_ID index)
{
    switch (index) {
        case OSC_ID_0 :
            return OSC_ExistsReferenceOscChange_PIC32_1(index);
        case OSC_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_OSC_ReferenceOscSwitchIsComplete(OSC_MODULE_ID index, OSC_REFERENCE referenceOsc)
{
    switch (index) {
        case OSC_ID_0 :
            return OSC_ReferenceOscSwitchIsComplete_PIC32_1(index, referenceOsc);
        case OSC_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_OSC_ExistsReferenceOscChangeActive(OSC_MODULE_ID index)
{
    switch (index) {
        case OSC_ID_0 :
            return OSC_ExistsReferenceOscChangeActive_PIC32_1(index);
        case OSC_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_OSC_ReferenceOscSourceChangeIsActive(OSC_MODULE_ID index, OSC_REFERENCE referenceOsc)
{
    switch (index) {
        case OSC_ID_0 :
            return OSC_ReferenceOscSourceChangeIsActive_PIC32_1(index, referenceOsc);
        case OSC_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_OSC_ExistsReferenceOscStopInSleep(OSC_MODULE_ID index)
{
    switch (index) {
        case OSC_ID_0 :
            return OSC_ExistsReferenceOscStopInSleep_PIC32_1(index);
        case OSC_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_OSC_ReferenceOscStopInSleepEnable(OSC_MODULE_ID index, OSC_REFERENCE referenceOsc)
{
    switch (index) {
        case OSC_ID_0 :
            OSC_ReferenceOscStopInSleepEnable_PIC32_1(index, referenceOsc);
            break;
        case OSC_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_OSC_ReferenceOscStopInSleepDisable(OSC_MODULE_ID index, OSC_REFERENCE referenceOsc)
{
    switch (index) {
        case OSC_ID_0 :
            OSC_ReferenceOscStopInSleepDisable_PIC32_1(index, referenceOsc);
            break;
        case OSC_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_OSC_ReferenceOscStopInSleepIsEnabled(OSC_MODULE_ID index, OSC_REFERENCE referenceOsc)
{
    switch (index) {
        case OSC_ID_0 :
            return OSC_ReferenceOscStopInSleepIsEnabled_PIC32_1(index, referenceOsc);
        case OSC_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_OSC_ExistsReferenceOutputEnable(OSC_MODULE_ID index)
{
    switch (index) {
        case OSC_ID_0 :
            return OSC_ExistsReferenceOutputEnable_PIC32_1(index);
        case OSC_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_OSC_ReferenceOutputEnable(OSC_MODULE_ID index, OSC_REFERENCE referenceOsc)
{
    switch (index) {
        case OSC_ID_0 :
            OSC_ReferenceOutputEnable_PIC32_1(index, referenceOsc);
            break;
        case OSC_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_OSC_ReferenceOutputDisable(OSC_MODULE_ID index, OSC_REFERENCE referenceOsc)
{
    switch (index) {
        case OSC_ID_0 :
            OSC_ReferenceOutputDisable_PIC32_1(index, referenceOsc);
            break;
        case OSC_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_OSC_ReferenceOutputIsEnabled(OSC_MODULE_ID index, OSC_REFERENCE referenceOsc)
{
    switch (index) {
        case OSC_ID_0 :
            return OSC_ReferenceOutputIsEnabled_PIC32_1(index, referenceOsc);
        case OSC_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_OSC_ExistsReferenceOscStopInIdleEnable(OSC_MODULE_ID index)
{
    switch (index) {
        case OSC_ID_0 :
            return OSC_ExistsReferenceOscStopInIdleEnable_PIC32_1(index);
        case OSC_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_OSC_ReferenceOscStopInIdleEnable(OSC_MODULE_ID index, OSC_REFERENCE referenceOsc)
{
    switch (index) {
        case OSC_ID_0 :
            OSC_ReferenceOscStopInIdleEnable_PIC32_1(index, referenceOsc);
            break;
        case OSC_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_OSC_ReferenceOscStopInIdleDisable(OSC_MODULE_ID index, OSC_REFERENCE referenceOsc)
{
    switch (index) {
        case OSC_ID_0 :
            OSC_ReferenceOscStopInIdleDisable_PIC32_1(index, referenceOsc);
            break;
        case OSC_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_OSC_ReferenceOscStopInIdleIsEnabled(OSC_MODULE_ID index, OSC_REFERENCE referenceOsc)
{
    switch (index) {
        case OSC_ID_0 :
            return OSC_ReferenceOscStopInIdleIsEnabled_PIC32_1(index, referenceOsc);
        case OSC_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_OSC_ExistsReferenceOscEnable(OSC_MODULE_ID index)
{
    switch (index) {
        case OSC_ID_0 :
            return OSC_ExistsReferenceOscEnable_PIC32_1(index);
        case OSC_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

